src/DataProcessors/ТекущиеДелаМЭДО/ТекущиеДелаМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ТекущиеДелаМЭДО</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/InformationRegisters/НастройкиОрганизацийМЭДО/НастройкиОрганизацийМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиОрганизацийМЭДО</name>
  <resources>
    <name>АдресМЭДО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидВходящегоДокументаПоУмолчанию</name>
    <comment>Специфичен для конфигурации Документооборот, при внедрении в другую конфигурацию может быть не актуален</comment>
    <type>
      <types>DefinedType.ВидДокументаМЭДО</types>
    </type>
  </resources>
  <resources>
    <name>ГрифИнформацияОграниченногоРаспространения</name>
    <type>
      <types>DefinedType.ГрифДоступаМЭДО</types>
    </type>
  </resources>
  <resources>
    <name>ГрифОбычнаяИнформация</name>
    <type>
      <types>DefinedType.ГрифДоступаМЭДО</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторМЭДО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогОтправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогОтправкиFTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогПолучения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогПолученияFTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаименованиеМЭДО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РазмерПорции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособОбмена</name>
    <type>
      <types>EnumRef.СпособыОбменаМЭДО</types>
    </type>
  </resources>
  <resources>
    <name>ШтампВысота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШтампСверху</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШтампСлева</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШтампШирина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СостоянияДокументовМЭДО/СостоянияДокументовМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияДокументовМЭДО</name>
  <enumValues>
    <name>ВходящийДокументЗарегистрирован</name>
    <comment>Для входящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ДокументЗарегистрированГотовКОтправке</name>
    <comment>Для исходящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ДокументОтправлен</name>
    <comment>Для исходящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ДокументПолучен</name>
    <comment>Для входящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ИсходящееУведомлениеЕщеНеОтправлено</name>
    <comment>Для входящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ИсходящийДокументЕщеНеОтправлен</name>
    <comment>Для исходящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ОтправкаОтменена</name>
    <comment>Для исходящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ОтправленаКвитанция</name>
    <comment>Для входящих документов и уведомлений</comment>
  </enumValues>
  <enumValues>
    <name>ОтправленаКвитанцияОбОшибке</name>
    <comment>Для входящих документов и уведомлений</comment>
  </enumValues>
  <enumValues>
    <name>ОтправленоУведомление</name>
    <comment>Для входящих документов</comment>
  </enumValues>
  <enumValues>
    <name>ПолученаКвитанция</name>
    <comment>Для исходящих документов и уведомлений</comment>
  </enumValues>
  <enumValues>
    <name>ПолученаКвитанцияОбОшибке</name>
    <comment>Для исходящих документов и уведомлений</comment>
  </enumValues>
  <enumValues>
    <name>ПолученоУведомление</name>
    <comment>Для исходящих документов</comment>
  </enumValues>
  <enumValues>
    <name>СозданаИсходящаяКвитанция</name>
    <comment>Для входящих документов и уведомлений</comment>
  </enumValues>
  <enumValues>
    <name>СозданоИсходящееУведомление</name>
    <comment>для входящих документов</comment>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипыУведомленийМЭДО/ТипыУведомленийМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУведомленийМЭДО</name>
  <enumValues>
    <name>ОРегистрации</name>
    <comment>documentAccepted</comment>
  </enumValues>
  <enumValues>
    <name>ОбОтказеВРегистрации</name>
    <comment>documentRefused</comment>
  </enumValues>
  <enumValues>
    <name>ОПостановкеНаКонтроль</name>
    <comment>documentSent</comment>
  </enumValues>
  <enumValues>
    <name>ОПринятииКИсполнению</name>
    <comment>executorAssigned</comment>
  </enumValues>
  <enumValues>
    <name>ОПодготовкеДоклада</name>
    <comment>reportPrepared</comment>
  </enumValues>
  <enumValues>
    <name>ОНаправленииДоклада</name>
    <comment>reportSent</comment>
  </enumValues>
  <enumValues>
    <name>ОХодеИсполнения</name>
    <comment>courseChanged</comment>
  </enumValues>
  <enumValues>
    <name>ОбОпубликовании</name>
    <comment>documentPublished</comment>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <comment>Организации</comment>
  <attributes>
    <name>ВидОбменаСКонтролирующимиОрганами</name>
    <type>
      <types>EnumRef.УдалитьВидыОбменаСКонтролирующимиОрганами</types>
      <types>EnumRef.ВидыОбменаСКонтролирующимиОрганами</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторССТУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныйПредприниматель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодНалоговогоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодНалоговогоОрганаПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКОНХ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганаПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганаФСГС</name>
    <comment>Код органа Федеральной службы государственной статистики</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КрупнейшийНалогоплательщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменКаталогОтправкиДанныхОтчетности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменКаталогПрограммыЭлектроннойПочты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменКодАбонента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлательщикНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияВНалоговомОргане</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗаписьОбмена</name>
    <type>
      <types>CatalogRef.УдалитьУчетныеЗаписиДокументооборота</types>
      <types>CatalogRef.УчетныеЗаписиДокументооборота</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/ТекущиеДелаМЭДО/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

	&НаКлиенте
	Процедура ПриОткрытии(Отказ)
		
		Элементы.ГруппаКомандыВходящиеДокументы.ТекущаяСтраница = Элементы.СтраницаПолучитьВходящиеДокументы;
		Элементы.ГруппаКомандыВходящиеУведомления.ТекущаяСтраница = Элементы.СтраницаПолучитьВходящиеУведомления;
		
		ОбновитьКаталогиОбмена();
		
		ОбновитьНаСервере();
		
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
		Если ИмяСобытия = "ЗаписьНастроекМЭДО" И Параметр = Объект.Организация Тогда
			ОбновитьКаталогиОбмена();
		КонецЕсли;
		
	КонецПроцедуры
	
	&НаСервере
	Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
		СписокОрганизаций = ОрганизацииНастроенныеДляМЭДО();
		Если СписокОрганизаций.Количество() > 0
			И СписокОрганизаций.НайтиПоЗначению(Объект.Организация) = Неопределено Тогда
			Объект.Организация = СписокОрганизаций[0].Значение;
		КонецЕсли;
		
		ЭтоПолноправныйПользователь = ИнтеграцияСМЭДО.ЕстьПолныеПрава();
		Элементы.РасширенныйВид.Пометка = ЭтоПолноправныйПользователь;
		УправлениеВидимостью();
		
	КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

	&НаКлиенте
	Процедура ОрганизацияПриИзменении(Элемент)
		
		ОчиститьСообщения();
		
		ОбновитьКаталогиОбмена();
		ОбновитьНаСервере();
		
	КонецПроцедуры

	&НаКлиенте
	Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = СписокОрганизаций;
		
	КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВходящиеДокументы

	&НаКлиенте
	Процедура ВходящиеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
		ДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
		
	КонецПроцедуры

	&НаКлиенте
	Процедура ВходящиеДокументыПриАктивизацииСтроки(Элемент)
		
		Если Элементы.ВходящиеДокументы.ТекущиеДанные = Неопределено Тогда
			Элементы.ГруппаКомандыВходящиеДокументы.ТекущаяСтраница = Элементы.СтраницаПолучитьВходящиеДокументы;
		Иначе
			Элементы.ГруппаКомандыВходящиеДокументы.ТекущаяСтраница = Элементы.СтраницаПолучитьИОтказатьВРегистрацииВходящиеДокументы;
		КонецЕсли;
		
	КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИсходящиеУведомления

	&НаКлиенте
	Процедура ИсходящиеУведомленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
		УведомленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
		
	КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВходящиеУведомления

	&НаКлиенте
	Процедура ВходящиеУведомленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
		УведомленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
		
	КонецПроцедуры

	&НаКлиенте
	Процедура ВходящиеУведомленияПриАктивизацииСтроки(Элемент)
		
		ВыбраныТолькоОтказы = Истина;
		Для Каждого Индекс Из Элемент.ВыделенныеСтроки Цикл
			ВыделеннаяСтрока = ВходящиеУведомления.НайтиПоИдентификатору(Индекс);
			Если Не (ВыделеннаяСтрока.Состояние
				= ПредопределенноеЗначение("Перечисление.СостоянияДокументовМЭДО.ПолученоУведомление")
				И ВыделеннаяСтрока.ТипУведомления 
				= ПредопределенноеЗначение("Перечисление.ТипыУведомленийМЭДО.ОбОтказеВРегистрации")) Тогда
				ВыбраныТолькоОтказы = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ВыбраныТолькоОтказы Тогда
			Элементы.ГруппаКомандыВходящиеУведомления.ТекущаяСтраница
				= Элементы.СтраницаПолучитьПовторитьИОтменитьОтправкуВходящиеУведомления;
		Иначе
			Элементы.ГруппаКомандыВходящиеУведомления.ТекущаяСтраница = Элементы.СтраницаПолучитьВходящиеУведомления;
		КонецЕсли;
		
	КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИсходящиеДокументы

	&НаКлиенте
	Процедура ИсходящиеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
		ДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
		
	КонецПроцедуры

#Конецобласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСостоянияДокументовМЭДО

	&НаКлиенте
	Процедура СостоянияДокументовМЭДОВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
		ДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
		
	КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
	
	&НаКлиенте
	Процедура ПолучитьВходящиеДокументы(Команда)
		
		ОчиститьСообщения();
		
		МЭДОВызовСервера.ПолучитьВходящиеДокументы(Объект.Организация);
		ОбновитьВходящиеДокументы();
		ОбновитьИсходящиеУведомления();
		
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ОтправитьИсходящиеУведомления(Команда)
		
		ОчиститьСообщения();
		
		МЭДОВызовСервера.ОтправитьИсходящиеКвитанции(Объект.Организация);
		
		МассивУведомлений = Новый Массив();
		Для Каждого Строка Из ИсходящиеУведомления.НайтиСтроки(Новый Структура("Использовать", Истина)) Цикл
			Если ТипЗнч(Строка.ПредметСообщения) = Тип("ДокументСсылка.УведомлениеМЭДО") Тогда
				МассивУведомлений.Добавить(Строка.ПредметСообщения);
			КонецЕсли;
		КонецЦикла;
		Если МассивУведомлений.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ДанныеОтвета = МЭДОКлиент.НовыйЛегкийОтвет();
		МЭДОВызовСервера.ОтправитьИсходящиеУведомления(Объект.Организация, ДанныеОтвета, МассивУведомлений);
		
		ОбновитьВходящиеДокументы();
		ОбновитьИсходящиеУведомления();
		
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ОтправитьИсходящиеДокументы(Команда)
		
		МассивДокументов = Новый Массив;
		Для Каждого Строка Из ИсходящиеДокументы.НайтиСтроки(Новый Структура("Использовать", Истина)) Цикл
			МассивДокументов.Добавить(Строка.Документ);
		КонецЦикла;
		Если МассивДокументов.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ОчиститьСообщения();
		
		МЭДОКлиент.НачатьОтправкуИсходящихДокументов(
			Объект.Организация,
			МассивДокументов,
			ЭтотОбъект,
			Новый ОписаниеОповещения("ОтправитьИсходящиеДокументыЗавершение", ЭтотОбъект));
		ОбновитьИсходящиеДокументы();
		ОбновитьВходящиеУведомления();
		
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ПолучитьВходящиеУведомления(Команда)
		
		ОчиститьСообщения();
		
		МЭДОВызовСервера.ПолучитьВходящиеУведомленияКвитанции(Объект.Организация);
		ОбновитьИсходящиеДокументы();
		ОбновитьВходящиеУведомления();
		
	КонецПроцедуры
	
	&НаКлиенте
	Процедура Обновить(Команда)
		
		ОбновитьНаСервере();
		Элементы.ВсеУведомленияСписок.Обновить();
		Элементы.СписокЖурналСобытий.Обновить();
		Элементы.СостоянияДокументовМЭДО.Обновить();
		
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ВходящиеДокументыСоздатьОтветноеУведомление(Команда)
		
		Если Элементы.ВходящиеДокументы.ВыделенныеСтроки = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		КолвоВыделенных = Элементы.ВходящиеДокументы.ВыделенныеСтроки.Количество();
		Если КолвоВыделенных = 0 Или КолвоВыделенных > 1 Тогда
			ПоказатьПредупреждение( , 
				НСтр("ru = 'Должна быть выделена одна строка в списке документов. 
				|Уведомление создается на конкретный документ!'"), , 
				НСтр("ru = 'Отменено'"));
			Возврат;
		КонецЕсли;
		
		ВыделеннаяСтрока = ВходящиеДокументы.НайтиПоИдентификатору(Элементы.ВходящиеДокументы.ВыделенныеСтроки[0]);
		МЭДОКлиент.СоздатьОтветноеУведомление(ВыделеннаяСтрока.Документ, ЭтотОбъект);
		
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ВходящиеДокументыОтказатьВРегистрации(Команда)
		
		Если Элементы.ВходящиеДокументы.ВыделенныеСтроки = Неопределено Тогда
			Возврат;
		КонецЕсли;
		КолвоВыделенных = Элементы.ВходящиеДокументы.ВыделенныеСтроки.Количество();
		Фраза = НСтр("ru = 'Укажите причину отказа.'");
		Если КолвоВыделенных = 0 Тогда
			Возврат;
		ИначеЕсли КолвоВыделенных = 1 Тогда
			Фраза = Фраза + НСтр("ru = ' Автоматически будет создано уведомление'");
		Иначе
			Фраза = Фраза + СтрШаблон(
				НСтр("ru = ' Автоматически будут созданы уведомления с этой причиной отказа по всем выделенным документам - %1 шт'"),
				КолвоВыделенных);
		КонецЕсли;
		
		ПричинаОтказа = Неопределено;
		ОписаниеОповещения = Новый ОписаниеОповещения("ВводПричиныОтказаВРегистрацииЗавершение", ЭтотОбъект);
		ПоказатьВводЗначения(
			ОписаниеОповещения, ПричинаОтказа, Фраза, Тип("СправочникСсылка.ПричиныОтказаВРегистрацииМЭДО"));
		
	КонецПроцедуры

	&НаКлиенте
	Процедура ЗапуститьЗадание(Команда)
		ЗапуститьЗаданиеНаСервере();
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ИсходящиеДокументыВыполнитьДействие(Команда)
		
		МассивДокументов = Новый Массив();
		Для Каждого Индекс Из Элементы.ВходящиеУведомления.ВыделенныеСтроки Цикл
			ВыделеннаяСтрока = ВходящиеУведомления.НайтиПоИдентификатору(Индекс);
			МассивДокументов.Добавить(ВыделеннаяСтрока.Документ);
		КонецЦикла;
		
		ИсходящиеДокументыВыполнитьДействиеНаСервере(МассивДокументов, Команда.Имя);
		ОбновитьИсходящиеДокументы();
		ОбновитьВходящиеУведомления();
		
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ИсходящиеУведомленияВыбратьВсе(Команда)
		
		ВыбратьВсеИсходящиеУведомления();
		
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ИсходящиеУведомленияСнятьВсе(Команда)
		
		СнятьВсеИсходящиеУведомления();
		
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ИсходящиеДокументыВыбратьВсе(Команда)
		
		ВыбратьВсеИсходящиеДокументы();
		
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ИсходящиеДокументыСнятьВсе(Команда)
		
		СнятьВсеИсходящиеДокументы();
		
	КонецПроцедуры
	
	&НаКлиенте
	Процедура РасширенныйВид(Команда)
		
		Элементы.РасширенныйВид.Пометка = Не Элементы.РасширенныйВид.Пометка;
		УправлениеВидимостью();
		
	КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
	#Область СлужебныеКлиентские
	
		&НаКлиенте
		Процедура ДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
			
			СтандартнаяОбработка = Ложь;
			Если Элемент.ТекущиеДанные = Неопределено Или Элемент.ТекущиеДанные.Свойство("Документ") = Ложь Тогда
				Возврат;
			КонецЕсли;
			ПоказатьЗначение(, Элемент.ТекущиеДанные.Документ);
			
		КонецПроцедуры
		
		&НаКлиенте
		Процедура УведомленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
			
			СтандартнаяОбработка = Ложь;
			Если Элемент.ТекущиеДанные = Неопределено Или Элемент.ТекущиеДанные.Свойство("ПредметСообщения") = Ложь Тогда
				Возврат;
			КонецЕсли;
			
			Если ТипЗнч(Элемент.ТекущиеДанные.ПредметСообщения) = Тип("ДокументСсылка.УведомлениеМЭДО") Тогда
				ПоказатьЗначение(, Элемент.ТекущиеДанные.ПредметСообщения);
			Иначе
				ПоказатьЗначение(, Элемент.ТекущиеДанные.Документ);
			КонецЕсли;
			
		КонецПроцедуры
		
		&НаКлиенте
		Процедура ОтправитьИсходящиеДокументыЗавершение(Результат, ПараметрыОповещения) Экспорт
			
			ОбновитьИсходящиеДокументы();
			ОбновитьВходящиеУведомления();
			
		КонецПроцедуры
		
		&НаКлиенте
		Процедура ВводПричиныОтказаВРегистрацииЗавершение(ПричинаОтказа, Параметры) Экспорт
			
			Если Не ЗначениеЗаполнено(ПричинаОтказа) Тогда
				Возврат;
			КонецЕсли;
			
			МассивДокументов = Новый Массив();
			Для Каждого Индекс Из Элементы.ВходящиеДокументы.ВыделенныеСтроки Цикл
				ВыделеннаяСтрока = ВходящиеДокументы.НайтиПоИдентификатору(Индекс);
				МассивДокументов.Добавить(ВыделеннаяСтрока.Документ);
			КонецЦикла;
			
			ВходящиеДокументыОтказатьВРегистрацииНаСервере(МассивДокументов, ПричинаОтказа);
			
			ОбновитьВходящиеДокументы();
			ОбновитьИсходящиеУведомления();
			
		КонецПроцедуры
	
	#КонецОбласти
	
	#Область СлужебныеСерверные
	
		&НаСервере
		Процедура ОбновитьНаСервере()
			
			ОбновитьВходящиеДокументы();
			ОбновитьИсходящиеУведомления();
			ОбновитьИсходящиеДокументы();
			ОбновитьВходящиеУведомления();
			
			СписокОрганизаций = ОрганизацииНастроенныеДляМЭДО();
			
		КонецПроцедуры
		
		&НаСервере
		Процедура ОбновитьКаталогиОбмена()
			
			Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
				Возврат;
			КонецЕсли;
			
			ДанныеОтвета = МЭДОСтруктурыДанных.НовыйЛегкийОтвет(Истина, "");
			Настройки = РегистрыСведений.НастройкиОрганизацийМЭДО.ПолучитьНастройки(Объект.Организация, ДанныеОтвета);
			Если Не ДанныеОтвета.Успех Тогда
				Возврат;
			КонецЕсли;
			КаталогОбменаПолучение = Настройки.КаталогПолучения;
			КаталогОбменаОтправка = Настройки.КаталогОтправки;
			
		КонецПроцедуры
		
		&НаСервере
		Процедура ОбновитьВходящиеДокументы()
			
			ВходящиеДокументы.Загрузить(МЭДО.ВходящиеДокументыКОбработке());
			
			Для Каждого Стр Из ВходящиеДокументы Цикл
				Стр.ПредставлениеДокумента = СтрШаблон(НСтр(
					"ru = '%1
					|Получен из сообщения: %2'"),
						СокрЛП(Стр.Документ),
						Стр.ИдентификаторСообщения)
			КонецЦикла;
			
		КонецПроцедуры
		
		&НаСервере
		Процедура ОбновитьИсходящиеУведомления()
			
			ДанныеОтвета = МЭДОСтруктурыДанных.НовыйЛегкийОтвет();
			Настройки = РегистрыСведений.НастройкиОрганизацийМЭДО.ПолучитьНастройки(
				Объект.Организация, ДанныеОтвета, "Организация, КаталогОтправки, РазмерПорции");
			Если Не ДанныеОтвета.Успех Тогда
				Возврат;
			КонецЕсли;
			ИсходящиеУведомления.Загрузить(МЭДО.ИсходящиеУведомленияКОтправке(Настройки));
			ВыбратьВсеИсходящиеУведомления();
			
		КонецПроцедуры
		
		&НаСервере
		Процедура ОбновитьИсходящиеДокументы()
			
			ДанныеОтвета = МЭДОСтруктурыДанных.НовыйЛегкийОтвет();
			Настройки = РегистрыСведений.НастройкиОрганизацийМЭДО.ПолучитьНастройки(
				Объект.Организация, ДанныеОтвета, "Организация, КаталогОтправки, РазмерПорции");
			Если Не ДанныеОтвета.Успех Тогда
				Возврат;
			КонецЕсли;
			ИсходящиеДокументы.Загрузить(МЭДО.ИсходящиеДокументыКОтправке(Настройки));
			ВыбратьВсеИсходящиеДокументы();
			
		КонецПроцедуры
		
		&НаСервере
		Процедура ОбновитьВходящиеУведомления()
			
			ВходящиеУведомления.Загрузить(МЭДО.ВходящиеУведомленияКОбработке());
			
		КонецПроцедуры
		
		&НаСервере
		Процедура ВходящиеДокументыОтказатьВРегистрацииНаСервере(МассивДокументов, ПричинаОтказа)
			
			МЭДО.СоздатьОтказыВРегистрации(МассивДокументов, ПричинаОтказа);
			
		КонецПроцедуры
		
		&НаСервере
		Процедура ИсходящиеДокументыВыполнитьДействиеНаСервере(МассивДокументов, Действие)
			
			Если Действие = "ИсходящиеДокументыПовторитьОтправку" Тогда
				
				Для Каждого Документ Из МассивДокументов Цикл
					МЭДО.ИзменитьПризнакОтправки(Документ, "ПовторитьОтправку");
				КонецЦикла;
				
			ИначеЕсли Действие = "ИсходящиеДокументыОтменитьОтправку" Тогда
				
				Для Каждого Документ Из МассивДокументов Цикл
					МЭДО.ИзменитьПризнакОтправки(Документ, "ОтменитьОтправку");
				КонецЦикла;
				
			Иначе
				Возврат;
			КонецЕсли;
			
		КонецПроцедуры
		
		&НаСервере
		Процедура ВыбратьВсеИсходящиеУведомления()
			
			Для Каждого Стр Из ИсходящиеУведомления Цикл
				Стр.Использовать = Истина;
			КонецЦикла;
			
		КонецПроцедуры
		
		&НаСервере
		Процедура СнятьВсеИсходящиеУведомления()
			
			Для Каждого Стр Из ИсходящиеУведомления Цикл
				Стр.Использовать = Ложь;
			КонецЦикла;
			
		КонецПроцедуры
		
		&НаСервере
		Процедура ВыбратьВсеИсходящиеДокументы()
			
			Для Каждого Стр Из ИсходящиеДокументы Цикл
				Стр.Использовать = Истина;
			КонецЦикла;
			
		КонецПроцедуры
		
		&НаСервере
		Процедура СнятьВсеИсходящиеДокументы()
			
			Для Каждого Стр Из ИсходящиеДокументы Цикл
				Стр.Использовать = Ложь;
			КонецЦикла;
			
		КонецПроцедуры
		
		&НаСервере
		Функция ОрганизацииНастроенныеДляМЭДО()
			
			Запрос = Новый Запрос(
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Настройки.Организация
				|ИЗ
				|	РегистрСведений.НастройкиОрганизацийМЭДО КАК Настройки
				|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
				|	Справочник.Организации КАК Организации
				|		ПО
				|			Организации.Ссылка = Настройки.Организация
				|УПОРЯДОЧИТЬ ПО
				|	Организация
				|АВТОУПОРЯДОЧИВАНИЕ");
			
			МассивОрганизаций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация");
			СписокОрганизаций = Новый СписокЗначений();
			СписокОрганизаций.ЗагрузитьЗначения(МассивОрганизаций);
			Возврат СписокОрганизаций;
			
		КонецФункции
		
		&НаСервере
		Процедура УправлениеВидимостью()
			
			Если Элементы.РасширенныйВид.Пометка Тогда
				Элементы.РасширенныйВид.Заголовок = НСтр("ru = 'Выключить расширенный вид'");
			Иначе
				Элементы.РасширенныйВид.Заголовок = НСтр("ru = 'Включить расширенный вид'");
			КонецЕсли;
			
			Элементы.СтраницаСостояния.Видимость = Элементы.РасширенныйВид.Пометка;
			Элементы.СтраницаЖурналСобытий.Видимость = Элементы.РасширенныйВид.Пометка;
			Элементы.СтраницаУведомления.Видимость = Элементы.РасширенныйВид.Пометка;
			
			Если Не ЭтоПолноправныйПользователь Тогда
				Элементы.ЗапуститьЗадание.Видимость = Ложь;
			КонецЕсли;
			
		КонецПроцедуры
	
		&НаСервере
		Процедура ЗапуститьЗаданиеНаСервере()
			МЭДО.ВыполнитьОбменМЭДО();
			ОбновитьНаСервере();
		КонецПроцедуры
	
	#КонецОбласти
	
#КонецОбласти
